nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/driver_examples/lpi2c/interrupt/hardware_init.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*${header:start}*/
#include "app.h"
#include "fsl_device_registers.h"
#include "pin_mux.h"
#include "board.h"
#include "clock_config.h"
#include "peripherals.h"
/*${header:end}*/

/*${function:start}*/
void BOARD_InitHardware(void)
{
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();

    BOARD_InitDebugConsole();
    EnableIRQWithPriority(BOARD_DEBUG_UART_RX_IRQ, BOARD_DEBUG_UART_ISR_PRORITY);
    EnableIRQWithPriority(BOARD_DEBUG_UART_TX_IRQ, BOARD_DEBUG_UART_ISR_PRORITY);
    EnableIRQWithPriority(BOARD_DEBUG_UART_RX_ERR_IRQ, BOARD_DEBUG_UART_ISR_PRORITY);
    EnableIRQWithPriority(BOARD_DEBUG_UART_TX_IDLE_IRQ, BOARD_DEBUG_UART_ISR_PRORITY);

    CLOCK_ConfigI2cClockSrc(kCLOCK_LPI2C0, kCLOCK_IPClkSrc_BusClk);
    CLOCK_ConfigI2cClockSrc(kCLOCK_LPI2C1, kCLOCK_IPClkSrc_BusClk);
    EnableIRQWithPriority(LPI2C0_IRQn, 1U);
    EnableIRQWithPriority(LPI2C1_IRQn, 2U);

    SetIRQBasePriority(0);
}
/*${function:end}*/
